In [202]:
import pandas as pd
import sqlite3
import datetime

In [203]:
# Conexión a la base de datos o creacion de la misma
conexion = sqlite3.connect("./Decathlon.db")
cursor = conexion.cursor()

In [204]:
def sql_query(query):

    # Ejecuta la query
    cursor.execute(query) 

    # Almacena los datos de la query 
    ans = cursor.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in cursor.description]

    return pd.DataFrame(ans,columns=names)

In [205]:
# Creamos las tablas necesarias
query = '''
CREATE TABLE PROVEEDOR (
    ID_proveedor INTEGER PRIMARY KEY,
    Nombre VARCHAR(50),
    Direccion VARCHAR(120),
    Ciudad VARCHAR(40),
    Provincia VARCHAR(40),
    CIF VARCHAR(10),
    Telefono VARCHAR(15),
    email VARCHAR(40)

)
'''
cursor.execute(query)

In [206]:
# Datos de distintos proveedores deportivos
datos_proveedores = [
    (1, "Adidas", "Calle Deportes, 123", "Barcelona", "Barcelona", "A12345678", "+34 123 456 789", "contacto@adidas.com"),
    (2, "Nike", "Avenida del Deporte, 456", "Madrid", "Comunidad de Madrid", "B87654321", "+34 987 654 321", "contacto@nike.com"),
    (3, "Puma", "Calle Fitness, 789", "Valencia", "Valencia", "C56789012", "+34 234 567 890", "contacto@puma.es"),
    (4, "Under Armour", "Carrera Extrema, 101", "Tarragona", "Barcelona", "D34567890", "+34 345 678 901", "contacto@underarmour.com"),
    (5, "GymShark", "Paseo del Deporte, 555", "Oviedo", "Principado de Asturias", "E23456789", "+34 456 789 012", "contacto@gymshark.com"),
    (6, "New Balance", "Plaza Deportiva, 222", "Plasencia", "Cáceres", "F45678901", "+34 567 890 123", "contacto@newbalance.com"),
    (7, "North Face", "Avenida de la Aventura, 333", "Leganés", "Comunidad de Madrid", "G56789012", "+34 678 901 234", "contacto@northface.com"),
    (8, "Deportes Pepito", "Calle Total, 444", "Novelda", "Alicante", "H67890123", "+34 789 012 345", "pepitodelospalotes1@gmail.es"),
]
# Insertar datos en la tabla Proveedor
insert_query = "INSERT INTO Proveedor (ID_Proveedor, Nombre, Direccion, Ciudad, Provincia, CIF, Telefono, email) VALUES (?, ?, ?, ?, ?, ?, ?, ?)"

# Ejecutar la sentencia SQL para insertar los datos en la tabla
cursor.executemany(insert_query, datos_proveedores)

# Confirmar la transacción
conexion.commit()

In [207]:
# Creamos la tabla Categoria
query = '''
CREATE TABLE CATEGORIA (
    ID_categoria INTEGER PRIMARY KEY,
    Nombre_Categoria VARCHAR)
'''
cursor.execute(query)

In [208]:
# Datos de 5 categorías de productos deportivos
datos_categorias = [
    (1, 'Calzado deportivo'),
    (2, 'Fitness'),
    (3, 'Ciclismo'),
    (4, 'Baloncesto'),
    (5, 'Natación'),
]
insert_query_categorias = "INSERT INTO Categoria (ID_Categoria, Nombre_Categoria) VALUES (?, ?)"

cursor.executemany(insert_query_categorias, datos_categorias)
conexion.commit()

In [209]:
# Creamos la tabla Productos
query = '''
CREATE TABLE PRODUCTOS (
    ID_Producto INTEGER PRIMARY KEY,
    Nombre VARCHAR(40),
    Color TEXT,
    Precio FLOAT,
    ID_Categoria INTEGER,
    FOREIGN KEY (ID_Categoria) REFERENCES Categoria(ID_Categoria)
)
'''
cursor.execute(query)

In [210]:
#Datos de 10 productos deportivos distintos
datos_productos = [
    (1, 'Balón de baloncesto', 'Naranja', 19.99, 4),
    (2, 'Camiseta', 'Azul', 14.99, 2),
    (3, 'Bicicleta normalita', 'Rosa', 209.99, 3),
    (4, 'Bicicleta eléctrica de lujo', 'Negro', 1599.99, 3),
    (5, 'Gorro de natación', 'Negro', 5.99, 5),
    (6, 'Zapatillas Air', 'Amarillo', 109.99, 1),
    (7, 'Alfombrilla de yoga', 'Azul', 14.99, 2),
    (8, 'Mancuernas 8kg.', 'Negro', 39.99, 2),
    (9, 'Zapatillas running', 'Verde', 89.99, 1),
    (10, 'Canasta', 'Rojo', 249.99, 4),
]
insert_query_productos = "INSERT INTO Productos (ID_Producto, Nombre, Color, Precio, ID_Categoria) VALUES (?, ?, ?, ?, ?)"

cursor.executemany(insert_query_productos, datos_productos)
conexion.commit()

In [211]:
query = """
CREATE TABLE FACTURAS (
    Id_factura VARCHAR(12) PRIMARY KEY,
    Id_proveedor VARCHAR(6),
    Id_producto VARCHAR(3),
    Precio FLOAT,
    Cantidad INTEGER,
    Fecha DATETIME,
    Pedido_recurrente BOOL,
    Total_factura FLOAT,
    FOREIGN KEY (Id_proveedor) REFERENCES PROVEEDOR(Id_proveedor)
    FOREIGN KEY (Id_producto) REFERENCES PRODUCTOS(Id_producto)
)
"""
cursor.execute(query)

In [212]:
datos_facturas = [
(1, 19.99, 1, '2024-03-20 12:22:53', True, 19.99, 2, 1),
(2, 5.99, 3, '2024-03-02 14:21:02', True, 17.97, 1, 5),
(3, 19.99, 2, '2024-03-20 09:09:09', True, 39.98, 1, 1),
(4, 14.99, 3, '2024-03-19 10:10:10', False, 44.97, 2, 7),
(5, 209.99, 1, '2024-03-18 11:11:11', True, 209.99, 3, 3),
(6, 1599.99, 1, '2024-03-17 12:12:12', True, 1599.99, 4, 4),
(7, 5.99, 2, '2024-03-16 12:13:14', False, 11.98, 5, 5),
(8, 109.99, 1, '2024-03-15 13:14:15', True, 109.99, 6, 6),
(9, 14.99, 3, '2024-03-14 18:18:18', True, 44.97, 7, 7),
(10, 39.99, 1, '2024-03-13 19:19:19', False, 39.99, 8, 8),
(11, 89.99, 2, '2024-03-12 20:19:18', True, 179.98, 1, 9),
(12, 249.99, 1, '2024-03-11 23:59:59', False, 249.99, 2, 10)
]

insert_query_facturas = "INSERT INTO FACTURAS (Id_factura, Precio, Cantidad, Fecha, Pedido_recurrente, Total_factura, Id_proveedor, Id_producto) VALUES (?,?,?,?,?,?,?,?)"

cursor.executemany(insert_query_facturas, datos_facturas)
conexion.commit()

In [213]:
query = '''
SELECT *
FROM Proveedor
'''

sql_query(query)

,ID_proveedor,Nombre,Direccion,Ciudad,Provincia,CIF,Telefono,email
0,1,Adidas,"Calle Deportes, 123",Barcelona,Barcelona,A12345678,+34 123 456 789,contacto@adidas.com
1,2,Nike,"Avenida del Deporte, 456",Madrid,Comunidad de Madrid,B87654321,+34 987 654 321,contacto@nike.com
2,3,Puma,"Calle Fitness, 789",Valencia,Valencia,C56789012,+34 234 567 890,contacto@puma.es
3,4,Under Armour,"Carrera Extrema, 101",Tarragona,Barcelona,D34567890,+34 345 678 901,contacto@underarmour.com
4,5,GymShark,"Paseo del Deporte, 555",Oviedo,Principado de Asturias,E23456789,+34 456 789 012,contacto@gymshark.com
5,6,New Balance,"Plaza Deportiva, 222",Plasencia,Cáceres,F45678901,+34 567 890 123,contacto@newbalance.com
6,7,North Face,"Avenida de la Aventura, 333",Leganés,Comunidad de Madrid,G56789012,+34 678 901 234,contacto@northface.com
7,8,Deportes Pepito,"Calle Total, 444",Novelda,Alicante,H67890123,+34 789 012 345,pepitodelospalotes1@gmail.es

In [214]:
query = '''
SELECT *
FROM facturas
'''

sql_query(query)

,Id_factura,Id_proveedor,Id_producto,Precio,Cantidad,Fecha,Pedido_recurrente,Total_factura
0,1,2,1,19.99,1,2024-03-20 12:22:53,1,19.99
1,2,1,5,5.99,3,2024-03-02 14:21:02,1,17.97
2,3,1,1,19.99,2,2024-03-20 09:09:09,1,39.98
3,4,2,7,14.99,3,2024-03-19 10:10:10,0,44.97
4,5,3,3,209.99,1,2024-03-18 11:11:11,1,209.99
5,6,4,4,1599.99,1,2024-03-17 12:12:12,1,1599.99
6,7,5,5,5.99,2,2024-03-16 12:13:14,0,11.98
7,8,6,6,109.99,1,2024-03-15 13:14:15,1,109.99
8,9,7,7,14.99,3,2024-03-14 18:18:18,1,44.97
9,10,8,8,39.99,1,2024-03-13 19:19:19,0,39.99
10,11,1,9,89.99,2,2024-03-12 20:19:18,1,179.98
11,12,2,10,249.99,1,2024-03-11 23:59:59,0,249.99

In [215]:
query = '''
SELECT DISTINCT Ciudad
FROM Proveedor
'''
sql_query(query)

      Ciudad
0  Barcelona
1     Madrid
2   Valencia
3  Tarragona
4     Oviedo
5  Plasencia
6    Leganés
7    Novelda

In [216]:
#Listado de los productos con su categoria correspondiente (catálogo)
query = '''
SELECT b.nombre_categoria as Categoria, a.nombre as Producto
FROM Productos AS a
LEFT JOIN Categoria AS b
ON a.ID_Categoria = b.ID_Categoria
ORDER BY b.nombre_categoria
'''

sql_query(query)

           Categoria                     Producto
0         Baloncesto          Balón de baloncesto
1         Baloncesto                      Canasta
2  Calzado deportivo               Zapatillas Air
3  Calzado deportivo           Zapatillas running
4           Ciclismo          Bicicleta normalita
5           Ciclismo  Bicicleta eléctrica de lujo
6            Fitness                     Camiseta
7            Fitness          Alfombrilla de yoga
8            Fitness              Mancuernas 8kg.
9           Natación            Gorro de natación

In [217]:
#Extraer los distintos productos que proveen los proveedores
query = '''
SELECT a.nombre, c.nombre
FROM Proveedor AS a
LEFT JOIN Facturas AS b
ON a.ID_proveedor = b.ID_proveedor
LEFT JOIN Productos AS c
ON b.ID_producto = c.ID_producto
'''
sql_query(query)

             Nombre                       Nombre
0            Adidas            Gorro de natación
1            Adidas          Balón de baloncesto
2            Adidas           Zapatillas running
3              Nike          Balón de baloncesto
4              Nike          Alfombrilla de yoga
5              Nike                      Canasta
6              Puma          Bicicleta normalita
7      Under Armour  Bicicleta eléctrica de lujo
8          GymShark            Gorro de natación
9       New Balance               Zapatillas Air
10       North Face          Alfombrilla de yoga
11  Deportes Pepito              Mancuernas 8kg.

In [218]:
#Facturas de proveedores con la cantidad ordenado por fecha
query = '''
SELECT  a.nombre as Proveedor, a.ciudad, b.cantidad, c.nombre as Producto, b.fecha
FROM Proveedor AS a
LEFT JOIN Facturas AS b
ON a.ID_proveedor = b.ID_proveedor
LEFT JOIN Productos AS c
ON b.ID_producto = c.ID_producto
ORDER BY b.Fecha
'''
sql_query(query)

,Proveedor,Ciudad,Cantidad,Producto,Fecha
0,Adidas,Barcelona,3,Gorro de natación,2024-03-02 14:21:02
1,Nike,Madrid,1,Canasta,2024-03-11 23:59:59
2,Adidas,Barcelona,2,Zapatillas running,2024-03-12 20:19:18
3,Deportes Pepito,Novelda,1,Mancuernas 8kg.,2024-03-13 19:19:19
4,North Face,Leganés,3,Alfombrilla de yoga,2024-03-14 18:18:18
5,New Balance,Plasencia,1,Zapatillas Air,2024-03-15 13:14:15
6,GymShark,Oviedo,2,Gorro de natación,2024-03-16 12:13:14
7,Under Armour,Tarragona,1,Bicicleta eléctrica de lujo,2024-03-17 12:12:12
8,Puma,Valencia,1,Bicicleta normalita,2024-03-18 11:11:11
9,Nike,Madrid,3,Alfombrilla de yoga,2024-03-19 10:10:10
10,Adidas,Barcelona,2,Balón de baloncesto,2024-03-20 09:09:09
11,Nike,Madrid,1,Balón de baloncesto,2024-03-20 12:22:53

In [219]:
#Cantidad total de productos pedidos agrupados por proveedor
query = '''
SELECT a.nombre AS Proveedor, SUM(b.cantidad) AS "Cantidad productos"
FROM Proveedor as a
LEFT JOIN Facturas b 
ON b.ID_Proveedor = a.ID_Proveedor
GROUP BY a.nombre
ORDER BY 2 DESC
'''
sql_query(query)

         Proveedor  Cantidad productos
0           Adidas                   7
1             Nike                   5
2       North Face                   3
3         GymShark                   2
4     Under Armour                   1
5             Puma                   1
6      New Balance                   1
7  Deportes Pepito                   1

In [220]:
#Facturas emitidas solo por Nike que no son recurrentes
query = '''
SELECT a.nombre as Proveedor, b.cantidad, c.nombre as Producto, b.total_factura as Precio, b.fecha
FROM Proveedor AS a
LEFT JOIN Facturas AS b
ON a.ID_proveedor = b.ID_proveedor
LEFT JOIN Productos AS c
ON b.ID_producto = c.ID_producto
WHERE a.nombre == "Nike" AND b.Pedido_recurrente == False
ORDER BY 2 DESC

'''
sql_query(query)

  Proveedor  Cantidad             Producto  Precio                Fecha
0      Nike         3  Alfombrilla de yoga   44.97  2024-03-19 10:10:10
1      Nike         1              Canasta  249.99  2024-03-11 23:59:59

In [221]:
#Productos recurrentes que son de categoría Fitness o Baloncesto
query = '''
SELECT  a.nombre_categoria as Categoria, b.nombre as Producto, d.nombre as Proveedor
FROM Categoria AS a
LEFT JOIN Productos AS b
ON a.ID_categoria = b.ID_categoria
LEFT JOIN Facturas AS c
ON b.ID_producto = c.ID_producto
LEFT JOIN Proveedor as d
ON d.ID_Proveedor = c.ID_Proveedor
WHERE a.nombre_categoria in ("Fitness","Baloncesto") AND c.Pedido_recurrente == True
'''
sql_query(query)

    Categoria             Producto   Proveedor
0     Fitness  Alfombrilla de yoga  North Face
1  Baloncesto  Balón de baloncesto      Adidas
2  Baloncesto  Balón de baloncesto        Nike

In [222]:
#Gasto total de compra de pedidos recurrentes
query = '''
SELECT  a.nombre as Proveedor, c.nombre as Producto, b.total_factura as "Dinero Gastado"
FROM Proveedor AS a
LEFT JOIN Facturas AS b
ON a.ID_proveedor = b.ID_proveedor
LEFT JOIN Productos AS c
ON b.ID_producto = c.ID_producto
WHERE b.Pedido_recurrente == True

'''
df = sql_query(query)
gastos = df["Dinero Gastado"].sum()
print(f"El dinero gastado con producto ya obtenido de momento este mes es de {gastos} euros")

El dinero gastado con producto ya obtenido de momento este mes es de 2222.86 euros

In [224]:
#Gasto pendiente de producto de pedidos no recurrentes
query = '''
SELECT  a.nombre as Proveedor, c.nombre as Producto, b.total_factura as "Dinero Gastado"
FROM Proveedor AS a
LEFT JOIN Facturas AS b
ON a.ID_proveedor = b.ID_proveedor
LEFT JOIN Productos AS c
ON b.ID_producto = c.ID_producto
WHERE b.Pedido_recurrente == False

'''
df = sql_query(query)
gastos = df["Dinero Gastado"].sum()
print(f"El gasto de pedidos no recurrentes es de {gastos} euros")

El gasto de pedidos no recurrentes es de 346.93 euros